zh/hdparm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<!-- 2018-02-28 Wed 11:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>hdparm</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="hdparm - Linux命令">
<meta name="description" content="hdparm provides a command line interface to various kernel interfaces supported by the Linux SATA/PATA/SAS "libata" subsystem and the older IDE driver subsystem. Many newer (2008 and later) USB drive enclosures now also support "SAT" (SCSI-ATA Command Translation) and therefore may also work with hdparm. E.g. recent WD "Passport" models and recent NexStar-3 enclosures. Some options may work correctly only with the latest kernels. get/set SATA/IDE device parameters ">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="hdparm - Linux命令">
<meta property="og:description" content="hdparm provides a command line interface to various kernel interfaces supported by the Linux SATA/PATA/SAS "libata" subsystem and the older IDE driver subsystem. Many newer (2008 and later) USB drive enclosures now also support "SAT" (SCSI-ATA Command Translation) and therefore may also work with hdparm. E.g. recent WD "Passport" models and recent NexStar-3 enclosures. Some options may work correctly only with the latest kernels. get/set SATA/IDE device parameters ">
<meta name="twitter:title" content="hdparm - Linux命令">
<meta name="twitter:description" content="hdparm provides a command line interface to various kernel interfaces supported by the Linux SATA/PATA/SAS "libata" subsystem and the older IDE driver subsystem. Many newer (2008 and later) USB drive enclosures now also support "SAT" (SCSI-ATA Command Translation) and therefore may also work with hdparm. E.g. recent WD "Passport" models and recent NexStar-3 enclosures. Some options may work correctly only with the latest kernels. get/set SATA/IDE device parameters ">
<link rel="alternate" href="http://linux-command.org/en/hdparm.html" hreflang="en" />
<link rel="alternate" href="http://linux-command.org/es/hdparm.html" hreflang="es" />
<link rel="alternate" href="http://linux-command.org/ja/hdparm.html" hreflang="ja" />
<link rel="alternate" href="http://linux-command.org/ko/hdparm.html" hreflang="ko" />
<link rel="alternate" href="http://linux-command.org/zh/hdparm.html" hreflang="zh" />
</head>
<body>
<div id="content">
<h1 class="title">hdparm</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">摘要</a>
<ul>
<li><a href="#introduction">介绍</a></li>
</ul>
</li>
<li><a href="#how-to-install">如何安装</a>
<ul>
<li><a href="#prerequisites">先决条件</a></li>
<li><a href="#install">安装</a>
<ul>
<li><a href="#org0e60fad">Ubuntu</a></li>
<li><a href="#org889b492">CentOS</a></li>
<li><a href="#org414438a">using RPM</a></li>
<li><a href="#orgfaedfff">from Source</a></li>
</ul>
</li>
<li><a href="#packages">安装的软件包</a></li>
<li><a href="#check">检查</a>
<ul>
<li><a href="#orgb2739cf">with RPM</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#usage">如何使用</a>
<ul>
<li><a href="#syntax">结构</a></li>
<li><a href="#configuration">组态</a></li>
<li><a href="#options">选项</a></li>
</ul>
</li>
<li><a href="#references">参考</a></li>
</ul>
</div>
</div>
<table id="org9af7f33" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Developer</td>
<td class="org-left">Mark Lord</td>
</tr>

<tr>
<td class="org-left">Version</td>
<td class="org-left"><span class="org-programming-version">9.53</span></td>
</tr>

<tr>
<td class="org-left">Release Date</td>
<td class="org-left"><span class="org-programming-date">2018-01-05</span></td>
</tr>

<tr>
<td class="org-left">Size</td>
<td class="org-left"><span class="org-programming-size">284KB</span></td>
</tr>

<tr>
<td class="org-left">License</td>
<td class="org-left"><span class="org-programming-license">BSD</span></td>
</tr>

<tr>
<td class="org-left">Type</td>
<td class="org-left">Utility</td>
</tr>
</tbody>
</table>

<div id="outline-container-org59a8995" class="outline-2">
<h2 id="overview"><a id="org59a8995"></a>摘要</h2>
<div class="outline-text-2" id="text-overview">
<p>
get/set SATA/IDE device parameters
</p>
</div>

<div id="outline-container-org497faaa" class="outline-3">
<h3 id="introduction"><a id="org497faaa"></a>介绍</h3>
<div class="outline-text-3" id="text-introduction">
<p>
hdparm provides a command line interface to various kernel interfaces supported by the Linux SATA/PATA/SAS "libata" subsystem and the older IDE driver subsystem. 
Many newer (2008 and later) USB drive enclosures now also support "SAT" (SCSI-ATA Command Translation) and therefore may also work with hdparm. 
E.g. recent WD "Passport" models and recent NexStar-3 enclosures. Some options may work correctly only with the latest kernels.
</p>
</div>
</div>
</div>

<div id="outline-container-org892811f" class="outline-2">
<h2 id="how-to-install"><a id="org892811f"></a>如何安装</h2>
<div class="outline-text-2" id="text-how-to-install">
</div>

<div id="outline-container-orgfea8c41" class="outline-3">
<h3 id="prerequisites"><a id="orgfea8c41"></a>先决条件</h3>
<div class="outline-text-3" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./update.html">update</a></li>
</ul>
</div>
</div>

<div id="outline-container-org03e9d58" class="outline-3">
<h3 id="install"><a id="org03e9d58"></a>安装</h3>
<div class="outline-text-3" id="text-install">
</div>

<div id="outline-container-org0e60fad" class="outline-4">
<h4 id="org0e60fad">Ubuntu</h4>
<div class="outline-text-4" id="text-org0e60fad">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install hdparm
</pre>
</div>
</div>
</div>

<div id="outline-container-org889b492" class="outline-4">
<h4 id="org889b492">CentOS</h4>
<div class="outline-text-4" id="text-org889b492">
<div class="org-src-container">
<pre class="src src-sh">$ sudo yum install hdparm -y
</pre>
</div>
</div>
</div>

<div id="outline-container-org414438a" class="outline-4">
<h4 id="org414438a">using RPM</h4>
<div class="outline-text-4" id="text-org414438a">
<ul class="org-ul">
<li>32 bit</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">$ sudo rpm -Uvh http://mirrors.hostemo.com/CentOS/6.3/os/i386/Packages/hdparm-9.16-3.4.el6.i686.rpm
</pre>
</div>
<ul class="org-ul">
<li>64 bit</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">$ sudo rpm -Uvh http://mirrors.hostemo.com/CentOS/6.3/os/x86_64/Packages/hdparm-9.16-3.4.el6.x86_64.rpm
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfaedfff" class="outline-4">
<h4 id="orgfaedfff">from Source</h4>
<div class="outline-text-4" id="text-orgfaedfff">
<ul class="org-ul">
<li>Download from <a href="https://sourceforge.net/projects/hdparm/">https://sourceforge.net/projects/hdparm/</a></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">$ make
$ sudo make install
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org62c9731" class="outline-3">
<h3 id="packages"><a id="org62c9731"></a>安装的软件包</h3>
<div class="outline-text-3" id="text-packages">
<ul class="org-ul">
<li>hdparm</li>
<li>powermgmt-base</li>
</ul>
</div>
</div>

<div id="outline-container-orga11e31a" class="outline-3">
<h3 id="check"><a id="orga11e31a"></a>检查</h3>
<div class="outline-text-3" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ hdparm -V
hdparm v9.51
</pre>
</div>
</div>

<div id="outline-container-orgb2739cf" class="outline-4">
<h4 id="orgb2739cf">with RPM</h4>
<div class="outline-text-4" id="text-orgb2739cf">
<div class="org-src-container">
<pre class="src src-sh">$ rpm -qa | grep hdparm
hdparm-9.16-3.4.el6.i686
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org8b4ecd7" class="outline-2">
<h2 id="usage"><a id="org8b4ecd7"></a>如何使用</h2>
<div class="outline-text-2" id="text-usage">
</div>

<div id="outline-container-org50189e3" class="outline-3">
<h3 id="syntax"><a id="org50189e3"></a>结构</h3>
<div class="outline-text-3" id="text-syntax">
<div class="org-src-container">
<pre class="src src-sh">hdparm [options] [device ...]
</pre>
</div>
</div>
</div>

<div id="outline-container-org969b0a2" class="outline-3">
<h3 id="configuration"><a id="org969b0a2"></a>组态</h3>
<div class="outline-text-3" id="text-configuration">
<ul class="org-ul">
<li><span class="org-programming-file">/etc/hdparm.conf</span></li>
</ul>
</div>
</div>

<div id="outline-container-org7882ed4" class="outline-3">
<h3 id="options"><a id="org7882ed4"></a>选项</h3>
<div class="outline-text-3" id="text-options">
<p>
基于版本<span class="org-programming-version">9.51</span>创建。
</p>

<ul class="org-ul">
<li><span class="org-programming-option">-a</span> :</li>
</ul>
<p>
Get/set fs readahead
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-A</span> :</li>
</ul>
<p>
Get/set the drive look-ahead flag (0/1)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-b</span> :</li>
</ul>
<p>
Get/set bus state (0 <code>= off, 1 =</code> on, 2 == tristate)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-B</span> :</li>
</ul>
<p>
Set Advanced Power Management setting (1-255)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-c</span> :</li>
</ul>
<p>
Get/set IDE 32-bit IO setting
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-C</span> :</li>
</ul>
<p>
Check drive power mode status
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-d</span> :</li>
</ul>
<p>
Get/set using_dma flag
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-D</span> :</li>
</ul>
<p>
Enable/disable drive defect management
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-E</span> :</li>
</ul>
<p>
Set cd/dvd drive speed
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-f</span> :</li>
</ul>
<p>
Flush buffer cache for device on exit
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-F</span> :</li>
</ul>
<p>
Flush drive write cache
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-g</span> :</li>
</ul>
<p>
Display drive geometry
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-h</span> :</li>
</ul>
<p>
Display terse usage information
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-H</span> :</li>
</ul>
<p>
Read temperature from drive (Hitachi only)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-i</span> :</li>
</ul>
<p>
Display drive identification
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-I</span> :</li>
</ul>
<p>
Detailed/current information directly from drive
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-J</span> :</li>
</ul>
<p>
Get/set Western DIgital "Idle3" timeout for a WDC "Green" drive (DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-k</span> :</li>
</ul>
<p>
Get/set keep_settings_over_reset flag (0/1)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-K</span> :</li>
</ul>
<p>
Set drive keep_features_over_reset flag (0/1)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-L</span> :</li>
</ul>
<p>
Set drive doorlock (0/1) (removable harddisks only)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-m</span> :</li>
</ul>
<p>
Get/set multiple sector count
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-M</span> :</li>
</ul>
<p>
Get/set acoustic management (0-254, 128: quiet, 254: fast)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-n</span> :</li>
</ul>
<p>
Get/set ignore-write-errors flag (0/1)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-N</span> :</li>
</ul>
<p>
Get/set max visible number of sectors (HPA) (VERY DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-p</span> :</li>
</ul>
<p>
Set PIO mode on IDE interface chipset (0,1,2,3,4,...)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-P</span> :</li>
</ul>
<p>
Set drive prefetch count
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-q</span> :</li>
</ul>
<p>
Change next setting quietly
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-Q</span> :</li>
</ul>
<p>
Get/set DMA queue_depth (if supported)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-r</span> :</li>
</ul>
<p>
Get/set device readonly flag (DANGEROUS to set)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-R</span> :</li>
</ul>
<p>
Get/set device write-read-verify flag
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-s</span> :</li>
</ul>
<p>
Set power-up in standby flag (0/1) (DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-S</span> :</li>
</ul>
<p>
Set standby (spindown) timeout
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-t</span> :</li>
</ul>
<p>
Perform device read timings
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-T</span> :</li>
</ul>
<p>
Perform cache read timings
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-u</span> :</li>
</ul>
<p>
Get/set unmaskirq flag (0/1)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-U</span> :</li>
</ul>
<p>
Obsolete
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-v</span> :</li>
</ul>
<p>
Use defaults; same as -acdgkmur for IDE drives
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-V</span> :</li>
</ul>
<p>
Display program version and exit immediately
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-w</span> :</li>
</ul>
<p>
Perform device reset (DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-W</span> :</li>
</ul>
<p>
Get/set drive write-caching flag (0/1)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-x</span> :</li>
</ul>
<p>
Obsolete
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-X</span> :</li>
</ul>
<p>
Set IDE xfer mode (DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-y</span> :</li>
</ul>
<p>
Put drive in standby mode
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-Y</span> :</li>
</ul>
<p>
Put drive to sleep
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-z</span> :</li>
</ul>
<p>
Re-read partition table
</p>
<ul class="org-ul">
<li><span class="org-programming-option">-Z</span> :</li>
</ul>
<p>
Disable Seagate auto-powersaving mode
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--dco-freeze</span> :</li>
</ul>
<p>
Freeze/lock current device configuration until next power cycle
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--dco-identify</span> :</li>
</ul>
<p>
Read/dump device configuration identify data
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--dco-restore</span> :</li>
</ul>
<p>
Reset device configuration back to factory defaults
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--dco-setmax</span> :</li>
</ul>
<p>
Use DCO to set maximum addressable sectors
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--direct</span> :</li>
</ul>
<p>
Use O_DIRECT to bypass page cache for timings
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--drq-hsm-error</span> :</li>
</ul>
<p>
Crash system with a "stuck DRQ" error (VERY DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--fallocate</span> :</li>
</ul>
<p>
Create a file without writing data to disk
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--fibmap</span> :</li>
</ul>
<p>
Show device extents (and fragmentation) for a file
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--fwdownload</span> :</li>
</ul>
<p>
Download firmware file to drive (EXTREMELY DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--fwdownload-mode3</span> :</li>
</ul>
<p>
Download firmware using min-size segments (EXTREMELY DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--fwdownload-mode3-max</span> :</li>
</ul>
<p>
Download firmware using max-size segments (EXTREMELY DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--fwdownload-mode7</span> :</li>
</ul>
<p>
Download firmware using a single segment (EXTREMELY DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--fwdownload-modee</span> :</li>
</ul>
<p>
Download firmware using mode E (min-size segments) (EXTREMELY DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--fwdownload-modee-max</span> :</li>
</ul>
<p>
Download firmware using mode E (max-size segments) (EXTREMELY DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--idle-immediate</span> :</li>
</ul>
<p>
Idle drive immediately
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--idle-unload</span> :</li>
</ul>
<p>
Idle immediately and unload heads
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--Istdin</span> :</li>
</ul>
<p>
Read identify data from stdin as ASCII hex
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--Istdout</span> :</li>
</ul>
<p>
Write identify data to stdout as ASCII hex
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--make-bad-sector</span> :</li>
</ul>
<p>
Deliberately corrupt a sector directly on the media (VERY DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--offset</span> :</li>
</ul>
<p>
use with -t, to begin timings at given offset (in GiB) from start of drive
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--prefer-ata12</span> :</li>
</ul>
<p>
Use 12-byte (instead of 16-byte) SAT commands when possible
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--read-sector</span> :</li>
</ul>
<p>
Read and dump (in hex) a sector directly from the media
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--repair-sector</span> :</li>
</ul>
<p>
Alias for the --write-sector option (VERY DANGEROUS)
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--sanitize-antifreeze-lock</span> :</li>
</ul>
<p>
Block sanitize-freeze-lock command until next power cycle
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--sanitize-block-erase</span> :</li>
</ul>
<p>
Start block erase operation
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--sanitize-crypto-scramble</span> :</li>
</ul>
<p>
Change the internal encryption keys that used for used data
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--sanitize-freeze-lock</span> :</li>
</ul>
<p>
Lock drive's sanitize features until next power cycle
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--sanitize-overwrite</span> :</li>
</ul>
<p>
PATTERN Overwrite the internal media with constant PATTERN
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--sanitize-status</span> :</li>
</ul>
<p>
Show sanitize status information
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--security-help</span> :</li>
</ul>
<p>
Display help for ATA security commands
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--trim-sector-ranges</span> :</li>
</ul>
<p>
Tell SSD firmware to discard unneeded data sectors: lba:count ..
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--trim-sector-ranges-stdin</span> :</li>
</ul>
<p>
Same as above, but reads lba:count pairs from stdin
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--verbose</span> :</li>
</ul>
<p>
Display extra diagnostics from some commands
</p>
<ul class="org-ul">
<li><span class="org-programming-option">--write-sector</span> :</li>
</ul>
<p>
Repair/overwrite a (possibly bad) sector directly on the media (VERY DANGEROUS)
</p>
</div>
</div>
</div>

<div id="outline-container-org8418e85" class="outline-2">
<h2 id="references"><a id="org8418e85"></a>参考</h2>
<div class="outline-text-2" id="text-references">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Hdparm">Wikipedia</a></li>
<li><a href="https://sourceforge.net/projects/hdparm/">Download on Sourceforge</a></li>
<li><a href="http://www.linuxfromscratch.org/blfs/view/cvs/general/hdparm.html">Linux from scratch</a></li>
<li><a href="https://www.ehowstuff.com/how-to-fix-bash-hdparm-command-not-found-on-linux-centos-6-3/">Fix hdparm command not found on Linux CentOS 6.3</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-28 Wed 11:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
